open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_gc2145.c
/****************************************************************************
 * board/beken/boards/bk7258/bk7258-ap/src/bk7258_gc2145.c
 *
 * GC2145 CMOS sensor bring-up: I2C init register table copied verbatim
 * from bk_avdk_smp release/v3.1.1
 * ap/components/bk_peripheral/src/dvp/dvp_gc2145.c
 * (sensor_gc2145_init_talbe: 585 entries, sensor_gc2145_640_480_table: 40
 * entries; both tables extracted programmatically via a Python script
 * that parses the {0xXX, 0xXX} pairs directly from the source file to
 * avoid manual-transcription errors, skipping the #if 0/#endif-guarded
 * 50Hz frame-rate block in sensor_gc2145_init_talbe that upstream itself
 * does not compile in).  YUV direct-capture only; no JPEG/H264 encoding,
 * fixed at 640x480 (no runtime resolution switching).
 *
 * This bring-up milestone deliberately does not implement full-frame
 * assembly: YUV_BUF's hardware line buffer only holds 8 lines at a time
 * (ping-pong), and a full 640x480 frame requires 60 consecutive line-done
 * interrupts with a running destination offset to assemble.  This test
 * only verifies the first line-done interrupt fires and its 8 lines
 * (10240 bytes = 640*8*2, YUV422) can be DMA-copied out of the PSRAM line
 * buffer -- see docs/superpowers/plans/2026-07-30-gc2145-camera-bringup.md
 * "background section" for the full architectural rationale and the
 * decision to scope this milestone down to a single line-done event
 * rather than full-frame capture.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "bk7258_gpio.h"
#include "bk7258_i2c1.h"
#include "bk7258_yuv_buf.h"
#include "bk7258_dma.h"

/* GC2145 is at 7-bit I2C address 0x3C (datasheet's 0x78 write / 0x79 read
 * are the pre-shifted 8-bit forms; bk7258_i2c1_write_reg() takes the
 * 7-bit form and performs the <<1 shift internally -- see
 * bk7258_i2c1.h). */
#define GC2145_I2C_ADDR      0x3Cu

/* DVP data/sync pins, per design doc section 2 (gpio_map.h
 * CAMERA_DVP_*_PIN macros) and Task 3 background verification: all of
 * MCLK/PCLK/HSYNC/VSYNC/PXDATA0-7 sit at pinmux function index 0 in their
 * respective gpio_map_table per-pin function arrays. */
#define DVP_MCLK_PIN         27u
#define DVP_PCLK_PIN         29u
#define DVP_HSYNC_PIN        30u
#define DVP_VSYNC_PIN        31u
#define DVP_DATA_PIN(i)      (32u + (i))
#define DVP_PINMUX_FUNCTION  0u

/* Camera reset and power-enable GPIOs, corrected against the actual
 * board schematic (AIDK_AI玩具开发板_原理图.pdf) after this driver's
 * first two hardware bring-up attempts both failed with the GC2145 never
 * ACKing the first I2C write (register 0xFE).  This driver's original
 * assumption -- ported from a *different* board's reference config
 * (bk_avdk_smp release/v3.1.1
 * projects/dvp_example/ap/config/bk7258_ap/config
 * CONFIG_DVP_CTRL_POWER_GPIO_ID=28) -- was that GPIO28 is a power-enable
 * pin.  The schematic (sheet 2/6 chip pin table) shows GPIO28's net label
 * is actually DVP_RST (wired to the DVP connector's pin 7 RST signal,
 * sheet 4/6), not power.
 *
 * The real power-enable signal is DVP_PWR_CTL, which the schematic shows
 * driven from GPIO49 (sheet 2/6: net label DVP_PWR_CTL sits at physical
 * pin 88, which the same sheet's main pin table identifies as
 * P49/ENET_RXD0/R1/D17). DVP_PWR_CTL simultaneously enables two LDOs on
 * sheet 3/6 ("DVP供电" section): U4 (ME6211C28M5G-N) producing the
 * camera's +2.8V analog supply, and U5 (RS3236-ADJ8YF5) producing an
 * adjustable DVDD whose feedback divider (R28=75K) is annotated
 * "1.8V 75K" -- i.e. this board's DVDD rail is already hardwired for
 * GC2145's documented 1.8V DVDD requirement (the same sheet 4/6 comment
 * block that lists "GC2145: 1.8V" alongside GC2053's 1.2V and HM1055's
 * 1.5V for the same connector, confirming this board's fixed divider was
 * chosen for GC2145 specifically). */
#define DVP_RESET_PIN        28u
#define DVP_POWER_PIN        49u

#define GC2145_CAPTURE_WIDTH   640u
#define GC2145_CAPTURE_HEIGHT  480u

/* One ping-pong line-buffer batch: 8 lines * width * 2 bytes/pixel
 * (YUV422 YUYV), matching bk_dvp.c's
 * "yuv_config.yuv_pingpong_length = config->width * 8 * 2". */
#define GC2145_LINE_BATCH_BYTES (GC2145_CAPTURE_WIDTH * 8u * 2u)

static uint8_t g_gc2145_line_buf[GC2145_LINE_BATCH_BYTES];

struct gc2145_reg
{
  uint8_t reg;
  uint8_t value;
};

static const struct gc2145_reg g_gc2145_init_regs[] =
{
  { 0xFE, 0xF0 },
  { 0xFE, 0xF0 },
  { 0xFE, 0xF0 },
  { 0xFC, 0x06 },
  { 0xF6, 0x00 },
  { 0xF7, 0x1D },
  { 0xF8, 0x84 },
  { 0xFA, 0x00 },
  { 0xF9, 0xFE },
  { 0xF2, 0x00 },
  { 0xFE, 0x00 },
  { 0x03, 0x04 },
  { 0x04, 0xE2 },
  { 0x09, 0x00 },
  { 0x0A, 0x00 },
  { 0x0B, 0x00 },
  { 0x0C, 0x00 },
  { 0x0D, 0x04 },
  { 0x0E, 0xC0 },
  { 0x0F, 0x06 },
  { 0x10, 0x52 },
  { 0x12, 0x2E },
  { 0x17, 0x14 },
  { 0x18, 0x22 },
  { 0x19, 0x0E },
  { 0x1A, 0x01 },
  { 0x1B, 0x4B },
  { 0x1C, 0x07 },
  { 0x1D, 0x10 },
  { 0x1E, 0x88 },
  { 0x1F, 0x78 },
  { 0x20, 0x03 },
  { 0x21, 0x40 },
  { 0x22, 0xA0 },
  { 0x24, 0x16 },
  { 0x25, 0x01 },
  { 0x26, 0x10 },
  { 0x2D, 0x60 },
  { 0x30, 0x01 },
  { 0x31, 0x90 },
  { 0x33, 0x06 },
  { 0x34, 0x01 },
  { 0xFE, 0x00 },
  { 0x80, 0x7F },
  { 0x81, 0x26 },
  { 0x82, 0xFA },
  { 0x83, 0x00 },
  { 0x84, 0x02 },
  { 0x86, 0x03 },
  { 0x88, 0x03 },
  { 0x89, 0x03 },
  { 0x85, 0x08 },
  { 0x8A, 0x00 },
  { 0x8B, 0x00 },
  { 0xB0, 0x55 },
  { 0xC3, 0x00 },
  { 0xC4, 0x80 },
  { 0xC5, 0x90 },
  { 0xC6, 0x3B },
  { 0xC7, 0x46 },
  { 0xEC, 0x06 },
  { 0xED, 0x04 },
  { 0xEE, 0x60 },
  { 0xEF, 0x90 },
  { 0xB6, 0x01 },
  { 0x90, 0x01 },
  { 0x91, 0x00 },
  { 0x92, 0x00 },
  { 0x93, 0x00 },
  { 0x94, 0x00 },
  { 0x95, 0x04 },
  { 0x96, 0xB0 },
  { 0x97, 0x06 },
  { 0x98, 0x40 },
  { 0xFE, 0x00 },
  { 0x40, 0x42 },
  { 0x41, 0x00 },
  { 0x43, 0x5B },
  { 0x5E, 0x00 },
  { 0x5F, 0x00 },
  { 0x60, 0x00 },
  { 0x61, 0x00 },
  { 0x62, 0x00 },
  { 0x63, 0x00 },
  { 0x64, 0x00 },
  { 0x65, 0x00 },
  { 0x66, 0x20 },
  { 0x67, 0x20 },
  { 0x68, 0x20 },
  { 0x69, 0x20 },
  { 0x76, 0x00 },
  { 0x6A, 0x08 },
  { 0x6B, 0x08 },
  { 0x6C, 0x08 },
  { 0x6D, 0x08 },
  { 0x6E, 0x08 },
  { 0x6F, 0x08 },
  { 0x70, 0x08 },
  { 0x71, 0x08 },
  { 0x76, 0x00 },
  { 0x72, 0xF0 },
  { 0x7E, 0x3C },
  { 0x7F, 0x00 },
  { 0xFE, 0x02 },
  { 0x48, 0x15 },
  { 0x49, 0x00 },
  { 0x4B, 0x0B },
  { 0xFE, 0x00 },
  { 0xFE, 0x01 },
  { 0x01, 0x04 },
  { 0x02, 0xC0 },
  { 0x03, 0x04 },
  { 0x04, 0x90 },
  { 0x05, 0x30 },
  { 0x06, 0x90 },
  { 0x07, 0x30 },
  { 0x08, 0x80 },
  { 0x09, 0x00 },
  { 0x0A, 0x82 },
  { 0x0B, 0x11 },
  { 0x0C, 0x10 },
  { 0x11, 0x10 },
  { 0x13, 0x7B },
  { 0x17, 0x00 },
  { 0x1C, 0x11 },
  { 0x1E, 0x61 },
  { 0x1F, 0x35 },
  { 0x20, 0x40 },
  { 0x22, 0x40 },
  { 0x23, 0x20 },
  { 0xFE, 0x02 },
  { 0x0F, 0x04 },
  { 0xFE, 0x01 },
  { 0x12, 0x35 },
  { 0x15, 0xB0 },
  { 0x10, 0x31 },
  { 0x3E, 0x28 },
  { 0x3F, 0xB0 },
  { 0x40, 0x90 },
  { 0x41, 0x0F },
  { 0xFE, 0x02 },
  { 0x90, 0x6C },
  { 0x91, 0x03 },
  { 0x92, 0xCB },
  { 0x94, 0x33 },
  { 0x95, 0x84 },
  { 0x97, 0x65 },
  { 0xA2, 0x11 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0x80, 0xC1 },
  { 0x81, 0x08 },
  { 0x82, 0x05 },
  { 0x83, 0x08 },
  { 0x84, 0x0A },
  { 0x86, 0xF0 },
  { 0x87, 0x50 },
  { 0x88, 0x15 },
  { 0x89, 0xB0 },
  { 0x8A, 0x30 },
  { 0x8B, 0x10 },
  { 0xFE, 0x01 },
  { 0x21, 0x04 },
  { 0xFE, 0x02 },
  { 0xA3, 0x50 },
  { 0xA4, 0x20 },
  { 0xA5, 0x40 },
  { 0xA6, 0x80 },
  { 0xAB, 0x40 },
  { 0xAE, 0x0C },
  { 0xB3, 0x46 },
  { 0xB4, 0x64 },
  { 0xB6, 0x38 },
  { 0xB7, 0x01 },
  { 0xB9, 0x2B },
  { 0x3C, 0x04 },
  { 0x3D, 0x15 },
  { 0x4B, 0x06 },
  { 0x4C, 0x20 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0x10, 0x09 },
  { 0x11, 0x0D },
  { 0x12, 0x13 },
  { 0x13, 0x19 },
  { 0x14, 0x27 },
  { 0x15, 0x37 },
  { 0x16, 0x45 },
  { 0x17, 0x53 },
  { 0x18, 0x69 },
  { 0x19, 0x7D },
  { 0x1A, 0x8F },
  { 0x1B, 0x9D },
  { 0x1C, 0xA9 },
  { 0x1D, 0xBD },
  { 0x1E, 0xCD },
  { 0x1F, 0xD9 },
  { 0x20, 0xE3 },
  { 0x21, 0xEA },
  { 0x22, 0xEF },
  { 0x23, 0xF5 },
  { 0x24, 0xF9 },
  { 0x25, 0xFF },
  { 0xFE, 0x00 },
  { 0xC6, 0x20 },
  { 0xC7, 0x2B },
  { 0xFE, 0x02 },
  { 0x26, 0x0F },
  { 0x27, 0x14 },
  { 0x28, 0x19 },
  { 0x29, 0x1E },
  { 0x2A, 0x27 },
  { 0x2B, 0x33 },
  { 0x2C, 0x3B },
  { 0x2D, 0x45 },
  { 0x2E, 0x59 },
  { 0x2F, 0x69 },
  { 0x30, 0x7C },
  { 0x31, 0x89 },
  { 0x32, 0x98 },
  { 0x33, 0xAE },
  { 0x34, 0xC0 },
  { 0x35, 0xCF },
  { 0x36, 0xDA },
  { 0x37, 0xE2 },
  { 0x38, 0xE9 },
  { 0x39, 0xF3 },
  { 0x3A, 0xF9 },
  { 0x3B, 0xFF },
  { 0xFE, 0x02 },
  { 0xD1, 0x32 },
  { 0xD2, 0x32 },
  { 0xD3, 0x40 },
  { 0xD6, 0xF0 },
  { 0xD7, 0x10 },
  { 0xD8, 0xDA },
  { 0xDD, 0x14 },
  { 0xDE, 0x86 },
  { 0xED, 0x80 },
  { 0xEE, 0x00 },
  { 0xEF, 0x3F },
  { 0xD8, 0xD8 },
  { 0xFE, 0x01 },
  { 0x9F, 0x40 },
  { 0xFE, 0x01 },
  { 0xC2, 0x14 },
  { 0xC3, 0x0D },
  { 0xC4, 0x0C },
  { 0xC8, 0x15 },
  { 0xC9, 0x0D },
  { 0xCA, 0x0A },
  { 0xBC, 0x24 },
  { 0xBD, 0x10 },
  { 0xBE, 0x0B },
  { 0xB6, 0x25 },
  { 0xB7, 0x16 },
  { 0xB8, 0x15 },
  { 0xC5, 0x00 },
  { 0xC6, 0x00 },
  { 0xC7, 0x00 },
  { 0xCB, 0x00 },
  { 0xCC, 0x00 },
  { 0xCD, 0x00 },
  { 0xBF, 0x07 },
  { 0xC0, 0x00 },
  { 0xC1, 0x00 },
  { 0xB9, 0x00 },
  { 0xBA, 0x00 },
  { 0xBB, 0x00 },
  { 0xAA, 0x01 },
  { 0xAB, 0x01 },
  { 0xAC, 0x00 },
  { 0xAD, 0x05 },
  { 0xAE, 0x06 },
  { 0xAF, 0x0E },
  { 0xB0, 0x0B },
  { 0xB1, 0x07 },
  { 0xB2, 0x06 },
  { 0xB3, 0x17 },
  { 0xB4, 0x0E },
  { 0xB5, 0x0E },
  { 0xD0, 0x09 },
  { 0xD1, 0x00 },
  { 0xD2, 0x00 },
  { 0xD6, 0x08 },
  { 0xD7, 0x00 },
  { 0xD8, 0x00 },
  { 0xD9, 0x00 },
  { 0xDA, 0x00 },
  { 0xDB, 0x00 },
  { 0xD3, 0x0A },
  { 0xD4, 0x00 },
  { 0xD5, 0x00 },
  { 0xA4, 0x00 },
  { 0xA5, 0x00 },
  { 0xA6, 0x77 },
  { 0xA7, 0x77 },
  { 0xA8, 0x77 },
  { 0xA9, 0x77 },
  { 0xA1, 0x80 },
  { 0xA2, 0x80 },
  { 0xFE, 0x01 },
  { 0xDF, 0x0D },
  { 0xDC, 0x25 },
  { 0xDD, 0x30 },
  { 0xE0, 0x77 },
  { 0xE1, 0x80 },
  { 0xE2, 0x77 },
  { 0xE3, 0x90 },
  { 0xE6, 0x90 },
  { 0xE7, 0xA0 },
  { 0xE8, 0x90 },
  { 0xE9, 0xA0 },
  { 0xFE, 0x00 },
  { 0xFE, 0x01 },
  { 0x4F, 0x00 },
  { 0x4F, 0x00 },
  { 0x4B, 0x01 },
  { 0x4F, 0x00 },
  { 0x4C, 0x01 },
  { 0x4D, 0x71 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x91 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x70 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x90 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xB0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8F },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6F },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xD0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xF0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6E },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8E },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAE },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCE },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAD },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCD },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAC },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCC },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCB },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAB },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8A },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xC9 },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8A },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0x89 },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xA9 },
  { 0x4E, 0x04 },
  { 0x4C, 0x02 },
  { 0x4D, 0x0B },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x0A },
  { 0x4E, 0x05 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEB },
  { 0x4E, 0x05 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEA },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x09 },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x29 },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x2A },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x4A },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x8A },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x49 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x69 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x89 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0xA9 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x48 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x68 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x69 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0xCA },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC9 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE9 },
  { 0x4E, 0x07 },
  { 0x4C, 0x03 },
  { 0x4D, 0x09 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC8 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE8 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xA7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x03 },
  { 0x4D, 0x07 },
  { 0x4E, 0x07 },
  { 0x4F, 0x01 },
  { 0x50, 0x80 },
  { 0x51, 0xA8 },
  { 0x52, 0x47 },
  { 0x53, 0x38 },
  { 0x54, 0xC7 },
  { 0x56, 0x0E },
  { 0x58, 0x08 },
  { 0x5B, 0x00 },
  { 0x5C, 0x74 },
  { 0x5D, 0x8B },
  { 0x61, 0xDB },
  { 0x62, 0xB8 },
  { 0x63, 0x86 },
  { 0x64, 0xC0 },
  { 0x65, 0x04 },
  { 0x67, 0xA8 },
  { 0x68, 0xB0 },
  { 0x69, 0x00 },
  { 0x6A, 0xA8 },
  { 0x6B, 0xB0 },
  { 0x6C, 0xAF },
  { 0x6D, 0x8B },
  { 0x6E, 0x50 },
  { 0x6F, 0x18 },
  { 0x73, 0xF0 },
  { 0x70, 0x0D },
  { 0x71, 0x60 },
  { 0x72, 0x80 },
  { 0x74, 0x01 },
  { 0x75, 0x01 },
  { 0x7F, 0x0C },
  { 0x76, 0x70 },
  { 0x77, 0x58 },
  { 0x78, 0xA0 },
  { 0x79, 0x5E },
  { 0x7A, 0x54 },
  { 0x7B, 0x58 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0xC0, 0x01 },
  { 0xC1, 0x44 },
  { 0xC2, 0xFD },
  { 0xC3, 0x04 },
  { 0xC4, 0xF0 },
  { 0xC5, 0x48 },
  { 0xC6, 0xFD },
  { 0xC7, 0x46 },
  { 0xC8, 0xFD },
  { 0xC9, 0x02 },
  { 0xCA, 0xE0 },
  { 0xCB, 0x45 },
  { 0xCC, 0xEC },
  { 0xCD, 0x48 },
  { 0xCE, 0xF0 },
  { 0xCF, 0xF0 },
  { 0xE3, 0x0C },
  { 0xE4, 0x4B },
  { 0xE5, 0xE0 },
  { 0xFE, 0x01 },
  { 0x9F, 0x40 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xF2, 0x0F },
  { 0xFE, 0x02 },
  { 0x40, 0xBF },
  { 0x46, 0xCF },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0x24, 0xFF },
  { 0xFE, 0x00 },
};

#define GC2145_INIT_REG_COUNT \
  (sizeof(g_gc2145_init_regs) / sizeof(g_gc2145_init_regs[0]))

static const struct gc2145_reg g_gc2145_640_480_regs[] =
{
  { 0xFE, 0x00 },
  { 0x05, 0x01 },
  { 0x06, 0x56 },
  { 0x07, 0x00 },
  { 0x08, 0x32 },
  { 0xFE, 0x01 },
  { 0x25, 0x00 },
  { 0x26, 0xFA },
  { 0x27, 0x04 },
  { 0x28, 0xE2 },
  { 0x29, 0x04 },
  { 0x2A, 0xE2 },
  { 0x2B, 0x04 },
  { 0x2C, 0xE2 },
  { 0x2D, 0x04 },
  { 0x2E, 0xE2 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xF8, 0x85 },
  { 0xFA, 0x00 },
  { 0xFE, 0x00 },
  { 0x09, 0x00 },
  { 0x0A, 0x78 },
  { 0x0B, 0x00 },
  { 0x0C, 0xA0 },
  { 0x0D, 0x03 },
  { 0x0E, 0xD0 },
  { 0x0F, 0x05 },
  { 0x10, 0x10 },
  { 0xFD, 0x01 },
  { 0x90, 0x01 },
  { 0x91, 0x00 },
  { 0x92, 0x00 },
  { 0x93, 0x00 },
  { 0x94, 0x00 },
  { 0x95, 0x01 },
  { 0x96, 0xE0 },
  { 0x97, 0x02 },
  { 0x98, 0x80 },
};

#define GC2145_640_480_REG_COUNT \
  (sizeof(g_gc2145_640_480_regs) / sizeof(g_gc2145_640_480_regs[0]))

static volatile bool g_line_ready;

static void bk7258_gc2145_power_on(void)
{
  bk7258_gpio_output(DVP_POWER_PIN, true);

  /* Settle delay after enabling the camera's two LDOs (+2.8V AVDD and
   * 1.8V DVDD, sheet 3/6) before any reset/I2C traffic; GC2145 datasheet
   * power-up timing is not available in this repo, so this uses the same
   * 120ms convention already established for GC9D01 hardware-reset
   * settling (docs/superpowers/plans/2026-07-29-gc9d01-lcd-bringup.md
   * Task 3, citing multiple bk_avdk_smp LCD drivers' uniform 120ms
   * post-reset delay) as a conservative, cross-checked default rather
   * than an unverified guess. */
  up_udelay(120000);
}

static void bk7258_gc2145_reset(void)
{
  /* DVP_RST (GPIO28) is active-low on the DVP connector's pin 7 RST
   * signal (schematic sheet 4/6): assert (drive low), hold, then
   * release (drive high) before I2C traffic, rather than this driver's
   * previous mistake of holding GPIO28 permanently high as if it were a
   * power-enable pin (see DVP_RESET_PIN's definition comment for the
   * schematic evidence behind this correction). Hold times are not in
   * this repo's GC2145 datasheet excerpt, so this reuses the same 120ms
   * conservative settling convention as bk7258_gc2145_power_on(). */
  bk7258_gpio_output(DVP_RESET_PIN, false);
  up_udelay(120000);
  bk7258_gpio_output(DVP_RESET_PIN, true);
  up_udelay(120000);
}

static void bk7258_gc2145_dvp_pinmux(void)
{
  uint32_t i;

  bk7258_gpio_set_function(DVP_MCLK_PIN, DVP_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_PCLK_PIN, DVP_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_HSYNC_PIN, DVP_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_VSYNC_PIN, DVP_PINMUX_FUNCTION);

  for (i = 0; i < 8; i++)
    {
      bk7258_gpio_set_function(DVP_DATA_PIN(i), DVP_PINMUX_FUNCTION);
    }
}

static bool bk7258_gc2145_write_reg_table(const struct gc2145_reg *table,
                                           size_t count)
{
  size_t i;

  for (i = 0; i < count; i++)
    {
      if (!bk7258_i2c1_write_reg(GC2145_I2C_ADDR, table[i].reg,
                                 table[i].value))
        {
          printf("gc2145: i2c write failed at reg 0x%02x (index %u)\n",
                 table[i].reg, (unsigned int)i);
          return false;
        }
    }

  return true;
}

static void bk7258_gc2145_line_done(bk7258_yuv_buf_bank_t bank, void *arg)
{
  (void)bank;
  (void)arg;
  g_line_ready = true;
}

int bk7258_gc2145_test(int argc, char **argv)
{
  uint32_t line_buf_addr;

  printf("gc2145: camera power on (GPIO%u)\n", DVP_POWER_PIN);
  bk7258_gc2145_power_on();

  printf("gc2145: camera reset (GPIO%u)\n", DVP_RESET_PIN);
  bk7258_gc2145_reset();

  printf("gc2145: dvp pinmux\n");
  bk7258_gc2145_dvp_pinmux();

  printf("gc2145: i2c1 init\n");
  bk7258_i2c1_init();

  printf("gc2145: writing %u init registers\n",
         (unsigned int)GC2145_INIT_REG_COUNT);
  if (!bk7258_gc2145_write_reg_table(g_gc2145_init_regs,
                                     GC2145_INIT_REG_COUNT))
    {
      printf("gc2145: init sequence aborted\n");
      return -1;
    }

  printf("gc2145: writing %u resolution (640x480) registers\n",
         (unsigned int)GC2145_640_480_REG_COUNT);
  if (!bk7258_gc2145_write_reg_table(g_gc2145_640_480_regs,
                                     GC2145_640_480_REG_COUNT))
    {
      printf("gc2145: resolution config aborted\n");
      return -1;
    }

  printf("gc2145: yuv_buf init\n");
  bk7258_yuv_buf_init();
  bk7258_yuv_buf_configure(GC2145_CAPTURE_WIDTH, GC2145_CAPTURE_HEIGHT);
  /* Note: this legacy smoke-test entry point only drains a single line
   * batch (whichever bank fires first) as a minimal "does the hardware
   * path work at all" check; it does not assemble a full frame -- that
   * logic now lives in bk7258_camera_imgdata.c's standard V4L2 driver
   * path, which this function intentionally does not duplicate. */
  bk7258_yuv_buf_set_line_callback(bk7258_gc2145_line_done, NULL);

  line_buf_addr = bk7258_yuv_buf_get_line_buf_addr();
  printf("gc2145: yuv_buf line buffer at 0x%08x\n",
         (unsigned int)line_buf_addr);

  printf("gc2145: dma init\n");
  bk7258_dma_init();

  printf("gc2145: starting capture\n");
  bk7258_yuv_buf_start();

  {
    int waited_ms = 0;
    const int max_wait_ms = 5000;

    while (!g_line_ready && waited_ms < max_wait_ms)
      {
        up_udelay(10000);
        waited_ms += 10;
      }
  }

  if (!g_line_ready)
    {
      printf("gc2145: timed out waiting for first line-done interrupt\n");
      bk7258_yuv_buf_stop();
      return -1;
    }

  printf("gc2145: line-done interrupt received, copying %u bytes via DMA\n",
         (unsigned int)GC2145_LINE_BATCH_BYTES);

  memset(g_gc2145_line_buf, 0, sizeof(g_gc2145_line_buf));
  bk7258_dma_configure(line_buf_addr, (uint32_t)(uintptr_t)g_gc2145_line_buf,
                       GC2145_LINE_BATCH_BYTES);
  bk7258_dma_start();

  {
    int waited_ms = 0;
    const int max_wait_ms = 1000;

    while (bk7258_dma_is_busy() && waited_ms < max_wait_ms)
      {
        up_udelay(1000);
        waited_ms += 1;
      }
  }

  if (bk7258_dma_is_busy())
    {
      printf("gc2145: dma timed out, remain_len=%u\n",
             (unsigned int)bk7258_dma_get_remain_len());
      bk7258_yuv_buf_stop();
      return -1;
    }

  printf("gc2145: dma completed, remain_len=%u\n",
         (unsigned int)bk7258_dma_get_remain_len());

  bk7258_yuv_buf_stop();

  printf("gc2145: capture test completed\n");
  return 0;
}
